/**
  ******************************************************************************
  * @file    turtle_bsp.h
  * @author  Xucz(OUC Fab U+/ROV Team)
  * @brief   Turtle 系列 ROV BSP 管理程序头文件
  ******************************************************************************
  * @attention
  *
  *
  ******************************************************************************
  */
#ifndef TURTLE_BSP_H
#define TURTLE_BSP_H

/* Includes ------------------------------------------------------------------*/
#include "turtle_g.h"
	
void Turtle_Bsp_Init(void);

#endif
