/**
  ******************************************************************************
  * @file    turtle_led_j101.c
  * @author  Xucz(OUC Fab U+/ROV Team)
  * @brief   Turtle 系列 ROV 水下灯管理程序
  *
  ******************************************************************************
  * @attention
  *
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "turtle_g.h"

void Turtle_LED_SetLumin(uint32_t ch, uint16_t pwm)
{
	if (pwm <= LED_PWM_MAX)
		__HAL_TIM_SET_COMPARE(&LED1_2_TIM,ch,pwm);
}
